[
  {
    "bodyPart": "back",
    "equipment": "cable",
    "gifUrl": "https://i.ibb.co/LhSzM9XC/lateral-pulldown.gif",
    "id": "0007",
    "name": "alternate lateral pulldown",
    "target": "lats",
    "secondaryMuscles": ["biceps", "rhomboids"],
    "instructions": [
      "Sit on the cable machine with your back straight and feet flat on the ground.",
      "Grasp the handles with an overhand grip, slightly wider than shoulder-width apart.",
      "Lean back slightly and pull the handles towards your chest, squeezing your shoulder blades together.",
      "Pause for a moment at the peak of the movement, then slowly release the handles back to the starting position.",
      "Repeat for the desired number of repetitions."
    ]
  },
  {
    "bodyPart": "back",
    "equipment": "leverage machine",
    "gifUrl": "https://i.ibb.co/k2nLCgv1/close-grip-pull-up.gif",
    "id": "0015",
    "name": "assisted parallel close grip pull-up",
    "target": "lats",
    "secondaryMuscles": ["biceps", "forearms"],
    "instructions": [
      "Adjust the machine to your desired weight and height.",
      "Place your hands on the parallel bars with a close grip, palms facing each other.",
      "Hang from the bars with your arms fully extended and your feet off the ground.",
      "Engage your back muscles and pull your body up towards the bars, keeping your elbows close to your body.",
      "Continue pulling until your chin is above the bars.",
      "Pause for a moment at the top, then slowly lower your body back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ]
  },
  {
    "bodyPart": "back",
    "equipment": "leverage machine",
    "gifUrl": "https://i.ibb.co/Lzxkr65k/assisted-pull-up.gif",
    "id": "0017",
    "name": "assisted pull-up",
    "target": "lats",
    "secondaryMuscles": ["biceps", "forearms"],
    "instructions": [
      "Adjust the machine to your desired weight and height settings.",
      "Grasp the handles with an overhand grip, slightly wider than shoulder-width apart.",
      "Hang with your arms fully extended and your feet off the ground.",
      "Engage your back muscles and pull your body up towards the handles, keeping your elbows close to your body.",
      "Continue pulling until your chin is above the handles.",
      "Pause for a moment at the top, then slowly lower your body back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ]
  },
  {
    "bodyPart": "back",
    "equipment": "barbell",
    "gifUrl": "https://i.ibb.co/k29zL9bF/barbell-pullover-press.gif",
    "id": "0022",
    "name": "barbell pullover to press",
    "target": "lats",
    "secondaryMuscles": ["triceps", "chest", "shoulders"],
    "instructions": [
      "Lie flat on a bench with your head at one end and your feet on the ground.",
      "Hold the barbell with a pronated grip (palms facing away from you) and extend your arms straight above your chest.",
      "Keeping your arms straight, lower the barbell behind your head in an arc-like motion until you feel a stretch in your lats.",
      "Pause for a moment, then reverse the motion and press the barbell back to the starting position above your chest.",
      "Repeat for the desired number of repetitions."
    ]
  },
  {
    "bodyPart": "back",
    "equipment": "barbell",
    "gifUrl": "https://i.ibb.co/yFYBRt40/barbell-bentover-row.gif",
    "id": "0027",
    "name": "barbell bent over row",
    "target": "upper back",
    "secondaryMuscles": ["biceps", "forearms"],
    "instructions": [
      "Stand with your feet shoulder-width apart and knees slightly bent.",
      "Bend forward at the hips while keeping your back straight and chest up.",
      "Grasp the barbell with an overhand grip, hands slightly wider than shoulder-width apart.",
      "Pull the barbell towards your lower chest by retracting your shoulder blades and squeezing your back muscles.",
      "Pause for a moment at the top, then slowly lower the barbell back to the starting position.",
      "Repeat for the desired number of repetitions."
    ]
  },
  {
    "bodyPart": "back",
    "equipment": "barbell",
    "gifUrl": "https://i.ibb.co/f3wkMvS/bent-arm-pullover.gif",
    "id": "0034",
    "name": "barbell decline bent arm pullover",
    "target": "lats",
    "secondaryMuscles": ["triceps", "chest"],
    "instructions": [
      "Lie down on a decline bench with your head lower than your hips and your feet secured.",
      "Hold a barbell with a pronated grip (palms facing away from you) and extend your arms straight above your chest.",
      "Lower the barbell behind your head in a controlled manner, keeping your arms slightly bent.",
      "Pause for a moment, then raise the barbell back to the starting position by contracting your lats.",
      "Repeat for the desired number of repetitions."
    ]
  },
  {
    "bodyPart": "back",
    "equipment": "barbell",
    "gifUrl": "https://i.ibb.co/gMcNhPqK/wide-grip-pullover.gif",
    "id": "0037",
    "name": "barbell decline wide-grip pullover",
    "target": "lats",
    "secondaryMuscles": ["triceps", "chest"],
    "instructions": [
      "Lie on a decline bench with your head lower than your hips and your feet secured.",
      "Hold a barbell with a wide grip and extend your arms straight above your chest.",
      "Lower the barbell behind your head in a controlled manner, keeping your arms straight.",
      "Pause for a moment, then raise the barbell back to the starting position.",
      "Repeat for the desired number of repetitions."
    ]
  },
  {
    "bodyPart": "back",
    "equipment": "barbell",
    "gifUrl": "https://i.ibb.co/VpNbcSrd/barbell-incline-row.gif",
    "id": "0049",
    "name": "barbell incline row",
    "target": "upper back",
    "secondaryMuscles": ["biceps", "forearms"],
    "instructions": [
      "Set up an incline bench at a 45-degree angle.",
      "Lie face down on the bench with your chest against the pad and your feet flat on the ground.",
      "Grasp the barbell with an overhand grip, slightly wider than shoulder-width apart.",
      "Keep your back straight and your core engaged.",
      "Pull the barbell towards your chest, squeezing your shoulder blades together.",
      "Pause for a moment at the top, then slowly lower the barbell back to the starting position.",
      "Repeat for the desired number of repetitions."
    ]
  },
  {
    "bodyPart": "back",
    "equipment": "barbell",
    "gifUrl": "https://i.ibb.co/FkjN4kJk/barbell-one-arm-row.gif",
    "id": "0064",
    "name": "barbell one arm bent over row",
    "target": "upper back",
    "secondaryMuscles": ["biceps", "forearms"],
    "instructions": [
      "Stand with your feet shoulder-width apart, knees slightly bent, and hold a barbell with one hand using an overhand grip.",
      "Bend forward at the hips, keeping your back straight and your head in a neutral position.",
      "Pull the barbell up towards your chest, keeping your elbow close to your body and squeezing your shoulder blades together.",
      "Lower the barbell back down to the starting position in a controlled manner.",
      "Repeat for the desired number of repetitions, then switch to the other arm."
    ]
  },
  {
    "bodyPart": "back",
    "equipment": "barbell",
    "gifUrl": "https://i.ibb.co/FkjN4kJk/barbell-one-arm-row.gif",
    "id": "0073",
    "name": "barbell pullover",
    "target": "lats",
    "secondaryMuscles": ["chest", "triceps"],
    "instructions": [
      "Lie flat on a bench with your head at one end and your feet on the floor.",
      "Hold a barbell with a shoulder-width grip and extend your arms straight above your chest.",
      "Keeping your arms straight, lower the barbell behind your head in a controlled manner until you feel a stretch in your lats.",
      "Pause for a moment, then raise the barbell back to the starting position.",
      "Repeat for the desired number of repetitions."
    ]
  }
]
